en/perl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-10 Mon 02:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>perl</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="perl - Linux Commands">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="perl - Linux Commands">
<meta property="og:description" content="">
<meta name="twitter:title" content="perl - Linux Commands">
<meta name="twitter:description" content="">
<link rel="alternate" href="http://linux-command.org/en/perl.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/perl.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/perl.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/perl.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/perl.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">perl</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#how-to-install">How to Install</a>
<ul>
<li><a href="#dependencies">Dependencies</a></li>
<li><a href="#install">Install</a>
<ul>
<li><a href="#orgded65c9">Ubuntu</a></li>
<li><a href="#orgb5f4554">CentOS</a></li>
</ul>
</li>
<li><a href="#packages">Installed Packages</a></li>
<li><a href="#check">Check</a></li>
</ul>
</li>
<li><a href="#references">References</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Version</td>
<td class="org-left"><span class="org-programming-version">5.24.1</span></td>
</tr>

<tr>
<td class="org-left">Package Size</td>
<td class="org-left"><span class="org-programming-size">12MB</span></td>
</tr>

<tr>
<td class="org-left">Installed Size</td>
<td class="org-left"><span class="org-programming-size">40MB</span></td>
</tr>
</tbody>
</table>

<div id="outline-container-org1b406af" class="outline-2">
<h2 id="how-to-install"><a id="org1b406af"></a>How to Install</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-org5d3e4b7" class="outline-3">
<h3 id="dependencies"><a id="org5d3e4b7"></a>Dependencies</h3>
<div class="outline-text-3" id="text-dependencies">
<ul class="org-ul">
<li>groff-base</li>
<li>perl-Carp</li>
<li>perl-Encode</li>
<li>perl-Exporter</li>
<li>perl-File-Path</li>
<li>perl-File-Temp</li>
<li>perl-Filter</li>
<li>perl-Getopt-Long</li>
<li>perl-HTTP-Tiny</li>
<li>perl-PathTools</li>
<li>perl-Pod-Escapes</li>
<li>perl-Pod-Perldoc</li>
<li>perl-Pod-Simple</li>
<li>perl-Pod-Usage</li>
<li>perl-Scalar-List-Utils</li>
<li>perl-Socket</li>
<li>perl-Storable</li>
<li>perl-Text-ParseWords</li>
<li>perl-Time-HiRes</li>
<li>perl-Time-Local</li>
<li>perl-constant</li>
<li>perl-libs</li>
<li>perl-macros</li>
<li>perl-parent</li>
<li>perl-podlators</li>
<li>perl-threads</li>
<li>perl-threads-shared</li>
</ul>
</div>
</div>

<div id="outline-container-org3be099e" class="outline-3">
<h3 id="install"><a id="org3be099e"></a>Install</h3>
<div class="outline-text-3" id="text-install">
</div>

<div id="outline-container-orgded65c9" class="outline-4">
<h4 id="orgded65c9">Ubuntu</h4>
<div class="outline-text-4" id="text-orgded65c9">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install perl
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5f4554" class="outline-4">
<h4 id="orgb5f4554">CentOS</h4>
<div class="outline-text-4" id="text-orgb5f4554">
<div class="org-src-container">
<pre class="src src-sh">$ sudo yum install perl
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb87ba24" class="outline-3">
<h3 id="packages"><a id="orgb87ba24"></a>Installed Packages</h3>
<div class="outline-text-3" id="text-packages">
<ul class="org-ul">
<li>perl</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2909e6" class="outline-3">
<h3 id="check"><a id="orgf2909e6"></a>Check</h3>
<div class="outline-text-3" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ perl -v
</pre>
</div>

<pre class="example">
This is perl 5, version 24, subversion 1 (v5.24.1) built for x86_64-linux-gnu-thread-multi
(with 60 registered patches, see perl -V for more detail)

Copyright 1987-2017, Larry Wall

Perl may be copied only under the terms of either the Artistic License or the
GNU General Public License, which may be found in the Perl 5 source kit.

Complete documentation for Perl, including FAQ lists, should be found on
this system using "man perl" or "perldoc perl".  If you have access to the
Internet, point your browser at http://www.perl.org/, the Perl Home Page.
</pre>
</div>
</div>
</div>

<div id="outline-container-org7dc0dcd" class="outline-2">
<h2 id="references"><a id="org7dc0dcd"></a>References</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><a href="http://dev.perl.org/perl5">Offical Homepage</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-03-03</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-12-10 Mon 02:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
